Revit 2026 API

# GenericGenericTransparencyImageFade Property

---

The property labeled "Image Fade" from the "Generic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GenericTransparencyImageFade { get; }
```
```vb
Public Shared ReadOnly Property GenericTransparencyImageFade As String
	Get
```
```cpp
public:
static property String^ GenericTransparencyImageFade {
	String^ get ();
}
```
```fsharp
static member GenericTransparencyImageFade : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1".

#### Reference

Generic Class

Autodesk.Revit.DB.Visual Namespace